# Hello, world
# Написать программу, которая выводит в точности строку "Hello, world"
#
# Примеры
#   Входные данные
#       test
#
#   Результат работы
#       Hello, World

print("Hello, world")
